app/controllers/memories_controller.rb

    def create

      # @memory = Memory.create(memory_params)
      ## @memory.users << current_user
      # @memory.save
      params[:memories].each do |memory|
---
SELECT  "memories".* FROM "memories"  ORDER BY "memories"."id" DESC LIMIT 1