app/controllers/memories_controller.rb

INSERT INTO "memories" ("memory_text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["memory_text", "a"], ["created_at", "2016-02-19 22:16:09.509207"], ["updated_at", "2016-02-19 22:16:09.509207"]]
---
    def create
      @memory = Memory.create(memory_params)

SELECT "memories".* FROM "memories"
---
    def index
      @memories = Memory.all

SELECT  "memories".* FROM "memories" WHERE "memories"."id" = $1 LIMIT 1  [["id", 0]]
---
    def show
      @memory = Memory.find(params[:id])