app/controllers/memory_controller.rb

    def index
      @memories = Memory.all
---
SELECT "memories".* FROM "memories"